<a href="https://colab.research.google.com/github/hashaski/Data_Base_Salario_Anual/blob/main/An%C3%A1lise_Explorat%C3%B3ria_dos_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import das bibliotecas e da base de dados.

In [2]:
import numpy as np
import pandas as pd

url = 'https://raw.githubusercontent.com/hashaski/Data_Base_Salario_Anual/main/ds_salaries.csv'

salario_anual = pd.read_csv(url)

salario_anual

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

Separando os dados que é do meu interesse, em que nesse caso seria os salários em USD.

In [5]:
salario_anual_usd = salario_anual.salary_in_usd
print(salario_anual_usd)

0       79833
1      260000
2      109024
3       20000
4      150000
        ...
602    154000
603    126000
604    129000
605    150000
606    200000
Name: salary_in_usd, Length: 607, dtype: int64

Média feita usando a biblioteca Numpy e manualmente.

In [19]:
media = np.mean(salario_anual_usd)
print(f'A média dos salários anuais em USD feita usando a biblioteca numpy é {media:.2f}')

def media_manual(list):
  return sum(list) / len(list)

print(f'A média manual dos salários anuais em USD é {media_manual(salario_anual_usd):.2f}')

A média dos salários anuais em USD feita usando a biblioteca numpy é 112297.87
A média manual dos salários anuais em USD é 112297.87